ams/src/Documents/AMS_ОбъединеннаяЗагрузка/AMS_ОбъединеннаяЗагрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ОбъединеннаяЗагрузка</name>
  <posting>Deny</posting>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обрешетка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПередачиТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Реализации</name>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Enums/AMS_СтатусыРеализаций/AMS_СтатусыРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СтатусыРеализаций</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Стикерование</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоРаспискеЭкспедитора</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов_УПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоУПДестьТНнет</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаБезДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ_12_Удалить</name>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/AMS_ОбъединеннаяЗагрузка/Forms/ФормаВыбораРеализации/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьРеализации();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеализации

&НаКлиенте
Процедура РеализацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Стр = Элемент.ТекущиеДанные;

	Данные = Новый Структура;
	Данные.Вставить("Реализация", Стр.Реализация);
	Данные.Вставить("ВремяДоставкиПо", Стр.ВремяДоставкиПо);
	Данные.Вставить("СуммаДокумента", Стр.СуммаДокумента);
	Данные.Вставить("КоличествоПалет", Стр.КоличествоПалет);
	Данные.Вставить("Вес", Стр.Вес);
	Данные.Вставить("Объем", Стр.Объем);
	Данные.Вставить("Обрешетка", Стр.Обрешетка);
	Данные.Вставить("СпособПередачиТоваров", Стр.СпособПередачиТоваров);
	Данные.Вставить("УсловияОтгрузки", Стр.УсловияОтгрузки);
	Данные.Вставить("ОсобыеУсловияПеревозкиОписание", Стр.ОсобыеУсловияПеревозкиОписание);

	Закрыть(Данные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРеализации()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Параметры.Дата);
	Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
	Запрос.УстановитьПараметр("СпособДоставки", Параметры.СпособДоставки);
	Запрос.УстановитьПараметр("ВремяДоставкиС", Параметры.ВремяДоставкиС);
	Запрос.УстановитьПараметр("АдресДоставки", Параметры.АдресДоставки);
	Запрос.УстановитьПараметр("МассивРеализаций", Параметры.МассивРеализаций);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК Реализация,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.AMS_Вес КАК Вес,
	|	т.AMS_Объем КАК Объем,
	|	т.AMS_Обрешетка КАК Обрешетка,
	|	т.AMS_СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	т.AMS_УсловияОтгрузки КАК УсловияОтгрузки,
	|	т.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Проведен
	|	И т.AMS_СтатусРеализации = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке)
	|	И т.Партнер = &Партнер
	|	И т.СпособДоставки = &СпособДоставки
	|	И т.ВремяДоставкиС = &ВремяДоставкиС
	|	И т.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика = &АдресДоставки
	|		ИНАЧЕ т.АдресДоставки = &АдресДоставки
	|	КОНЕЦ
	|	И НЕ т.Ссылка В (&МассивРеализаций)
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Номер";
	Реализации.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти
